/*
Создать класс RepkaPuller с полями `имя` и `порядковый номер в цепи`.
В main-методе создать ArrayList, добавить в его объекты мышки, кошки, жучки, внучки, бабки, дедки, бэтмена,
заполняя поле `порядковый номер в цепи` в случайном порядке.
Отсортировать ArrayList по порядковому номеру, используя Comparator, вывести в консоль.
Удалить из листа лишнего персонажа.
Создать из этого листа - HashSet. Добавить в Set бетмена.
Удалить из Set-a всех, у кого `порядковый номер в цепи` больше 3.
Создать HashMap<String, Integer>, заполнить его данными из предыдущего ArrayList-а,
где ключ - имя, значение - порядковый номер в цепи.
 */

public class Task08 {
}
