/*
Выведите на экран следующий текст:
Пройдёт много лет, и полковник Аурелиано Буэндиа, стоя у стены в ожидании расстрела, вспомнит тот далёкий вечер,
когда отец взял его с собой смотреть на лёд. Макогда было тогда небольшим селением с двумя десятками хижин,
выстроенных из глины и бамбука на берегу реки, которая мчала свои прозрачные воды...
*/

public class Task03 {
    public static void main(String[] args) {
        System.out.println("Пройдёт много лет, и полковник Аурелиано Буэндиа, стоя у стены в ожидании расстрела," +
                " вспомнит тот далёкий вечер, когда отец взял его с собой смотреть на лёд. Макогда было тогда" +
                " небольшим селением с двумя десятками хижин, выстроенных из глины и бамбука на берегу реки," +
                " которая мчала свои прозрачные воды...");
    }
}
